# pandas 리스트

In [2]:
import pandas as pd

# DF 열에 맞추어서 생성하기
df = pd.DataFrame([[23, '남', '서울특별시'], [53, '여', '제주특별자치도']],
                  index=['A00301', 'D00809'],
                  columns=['연령', '성별', '거주지'])
df

        연령 성별      거주지
A00301  23  남    서울특별시
D00809  53  여  제주특별자치도

In [3]:
df.rename(index={'A00301':'환자1','D00809':'환자2'}, inplace=True)
df

     연령 성별      거주지
환자1  23  남    서울특별시
환자2  53  여  제주특별자치도

In [4]:
df.rename(columns={'연령':'age','성별':'gender','거주지':'addr'}, inplace=True)
df

     age gender     addr
환자1   23      남    서울특별시
환자2   53      여  제주특별자치도

In [5]:
df.rename(index={'환자1':'가짜환자','환자2':'진짜환자'}, inplace=True)

In [6]:
df

      age gender     addr
가짜환자   23      남    서울특별시
진짜환자   53      여  제주특별자치도

In [23]:
# loc : 인덱스의 이름을 기준으로 선택
# iloc : 특정 위치를 인덱스의 정수값으로 선택
df = pd.DataFrame([[25,'남',185,89],[19,'여',163,53]],
                  index = ['이겨레','조약돌'],
                  columns = ['나이','성별','키','체중']
                 )
df

     나이 성별    키  체중
이겨레  25  남  185  89
조약돌  19  여  163  53

In [24]:
df.iloc[0]

나이     25
성별      남
키     185
체중     89
Name: 이겨레, dtype: object

In [25]:
df.iloc[[0,1]] # index의 정수값 가져오는것

     나이 성별    키  체중
이겨레  25  남  185  89
조약돌  19  여  163  53

In [26]:
df.loc['이겨레'] # loc 도 index의 값 불러 오는것

나이     25
성별      남
키     185
체중     89
Name: 이겨레, dtype: object

# pandas 딕셔너리

In [27]:
bio_data = {'나이':[25,19],'성별':['남','여'],'키':[185,163],'체중':[89,53]}
df = pd.DataFrame(bio_data, index=['이겨레','조약돌'])
df

     나이 성별    키  체중
이겨레  25  남  185  89
조약돌  19  여  163  53

In [28]:
df.loc['이겨레']

나이     25
성별      남
키     185
체중     89
Name: 이겨레, dtype: object

In [30]:
df.loc[['이겨레','조약돌']]

     나이 성별    키  체중
이겨레  25  남  185  89
조약돌  19  여  163  53

In [31]:
df.iloc[0]

나이     25
성별      남
키     185
체중     89
Name: 이겨레, dtype: object

In [32]:
df.iloc[[0,1]]

     나이 성별    키  체중
이겨레  25  남  185  89
조약돌  19  여  163  53

In [33]:
df.iloc[1]

나이     19
성별      여
키     163
체중     53
Name: 조약돌, dtype: object

In [34]:
df.loc['이겨레':'조약돌'] # df.loc[['이겨레','조약돌']] 똑같다

     나이 성별    키  체중
이겨레  25  남  185  89
조약돌  19  여  163  53

In [35]:
df.loc[['이겨레','조약돌']]

     나이 성별    키  체중
이겨레  25  남  185  89
조약돌  19  여  163  53

In [39]:
df.iloc[0:2] # 마지막 검색 범위는 불포함

     나이 성별    키  체중
이겨레  25  남  185  89
조약돌  19  여  163  53